---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCExporterService
source: html/5afe33cc-fc32-879e-4f51-a0388b2bc8e6.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCExporterService Property

The external service which permits registration of an alternate implementation for IFC export.

## Syntax (C#)
```csharp
public static ExternalServiceId IFCExporterService { get; }
```